---
kind: property
id: P:Autodesk.Revit.DB.RoofBase.FasciaDepth
source: html/cf9770df-dff0-015b-8dfb-139851632a61.htm
---
# Autodesk.Revit.DB.RoofBase.FasciaDepth Property

Retrieve or set the FasciaDepth.

## Syntax (C#)
```csharp
public double FasciaDepth { get; set; }
```

## Remarks
If the EaveCutterType is PlumbCut, this property doesn't make sense.